---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings
source: html/47ba6180-9317-6b60-a22f-caf3ab147c25.htm
---
# MEPHiddenLineSettings Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.